Group 06 requirements final version (#125)
